namespace Travel_Map
{
    public partial class Form1 : Form
    {
        private Dictionary<int, string> cities = new Dictionary<int, string>()
        {
            { 1, "София"},
            { 2, "Пловдив"},
            { 3, "Варна"},
            { 4, "Бургас"},
            { 5, "Русе"},
            { 6, "Стара Загора"},
            { 7, "Благоевград"},
            { 8, "Велико Търново"},
            { 9, "Плевен"},
            { 10, "Разград"},
        };

        private int[,] map = new int[,]
        {
            //  0   1   2   3   4   5   6   7   8   9   10
              { 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,   0 },  // 0
              { 0,  0,144,  0,  0,  0,  0,100,  0,100,   0 },  // 1 София
              { 0,144,  0,  0,  0,  0,103,236,221,  0,   0 },  // 2 Пловдив
              { 0,  0,  0,  0,130,  0,  0,  0,  0,  0, 130 },  // 3 Варна
              { 0,  0,  0,130,  0,  0,172,  0,215,  0,   0 },  // 4 Бургас
              { 0,  0,  0,  0,  0,  0,  0,  0,108,150,  70 },  // 5 Русе
              { 0,  0,103,  0,172,  0,  0,  0,  0,  0,   0 },  // 6 Стара Загора
              { 0,100,236,  0,  0,  0,  0,  0,  0,  0,   0 },  // 7 Благоевград
              { 0,  0,221,  0,215,108,  0,  0,  0,120, 134 },  // 8 Велико Търново
              { 0,100,  0,  0,  0,150,  0,  0,120,  0,   0 },  // 9 Плевен
              { 0,  0,  0,130,  0, 70,  0,  0,134,  0,   0 },  //10 Разград
        };

        public Form1()
        {
            InitializeComponent();
        }

        private void buttonCalculate_Click(object sender, EventArgs e)
        {

        }
    }
}
