namespace MultiDimensionalArrays
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*
             * Какво е двумерен масив? - Масив от масиви.
             * Таблица, на която всяка клетка се идентифицира чрез две измерения -
             * реда и номера на колоната в таблицата.
             * Елементите в него са от един и същи тип - int, double, string, ...
             * Елементите във всяко измерение са номерирани с два индекса:
             *  - ред - от 0 до (броя на редовете - 1)
             *  - колона - от 0 до (броя на колоните - 1).
             */

            // Деклариране на двумерен масив (от числа)
            int[,] twoDimensionalArray;

            // Деклариране на тримерен масив (от низове)
            string[,,] threeDimensionalArray;

            // Деклариране и заделяне на памет за масива
            int[,] numbers = new int[3, 4]; // таблица с 3 реда и 4 колони

            // Инициализация на двумерен масив
            string[,] animalsTable = new string[,]
            {
                { "cat", "dog", "fox"},
                { "giraffe", "lion", "wolf"}
            }; // двумерен масив 2 х 3 (2 реда и 3 колони)

            // Достъп до елементите на двумерен масив
            // - елемент на ред 1, колона 2, като индексите се отделят със запетаи
            Console.WriteLine(animalsTable[1, 2]); // изход --> wolf

            // Дължина на многомерен масив
            // Всяко измерение може да има различна дължина.
            // GetLength(индекс_измерение) - връща дължината на измерението с дадения индекс
            // Нека отпечатаме броя на редовете (индекс 0)
            Console.WriteLine(animalsTable.GetLength(0));   // изход --> 2
            // Нека отпечатаме броя на колоните (индекс 1)
            Console.WriteLine(animalsTable.GetLength(1));   // изход --> 3

            // Отпечатване на двумерен масив (таблица, матрица)
            for (int row = 0; row < animalsTable.GetLength(0); row++) // обхождане по редове
            {
                for (int col = 0; col < animalsTable.GetLength(1); col++) // обхождане по колони
                {
                    Console.Write($"{animalsTable[row, col], 10}"); // изпечатване на елемента
                }
                Console.WriteLine(); // преминаване на нов ред
            }

            // изход -->        cat     dog     fox
            //              giraffe    lion    wolf
        }
    }
}
